---
kind: property
id: P:Autodesk.Revit.DB.ExternalDefinition.Description
source: html/a9b39143-83e0-fb36-b48f-9204d40c81ab.htm
---
# Autodesk.Revit.DB.ExternalDefinition.Description Property

The description of the parameter. The description will be used as tooltip in the Revit UI including in the properties palette.

## Syntax (C#)
```csharp
public virtual string Description { get; }
```